## Staging: hosted_zone
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |             NAME              |
|--------|-------------------------------|
| add    | `aws_route53_zone.ai_answers` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route53_zone.ai_answers will be created
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route53_zone" "ai_answers" {
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                 = (known after apply)
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + comment             = "Managed by Terraform"
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + force_destroy       = false
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                  = (known after apply)
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                = "ai-answers.cdssandbox.xyz"
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_servers        = (known after apply)
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + primary_name_server = (known after apply)
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                = {
[0;90m20:25:40.745[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all            = {
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + zone_id             = (known after apply)
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 1 to add, 0 to change, 0 to destroy.
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + hosted_zone_id = (known after apply)
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m20:25:40.746[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
